Repository: ttcdt/mp-5.x
Catalog: po/*.po
Languages: it

source: Usage: mp-5 [options] [files...] Options: -t {tag} Edits the file where tag is defined -e {mpsl_code} Executes MPSL code -f {mpsl_script} Executes MPSL script file -F {mpsl_script} Executes MPSL script file and exits -d {directory} Set current directory -x {file} Opens file in the hexadecimal viewer -txt Uses text mode instead of GUI +NNN Moves to line number NNN of last file -ni Non-interactive (to be used with -e or -f)
it: Utilizzo: mp-5 [opzioni] [file ...] Opzioni: -t {tag} Modifica il file in cui è definito il tag -e {mpsl_code} Esegue il codice MPSL -f {mpsl_script} Esegue il file di script MPSL -F {mpsl_script} Esegue il file di script MPSL ed esce -d {directory} Imposta la directory corrente -x {file} Apre il file nel visualizzatore esadecimale -txt Usa la modalità testo invece della GUI + NNN P assa al numero di riga NNN dell'ultimo file -ni Non interattivo (da utilizzare con -e o -f)

source: C/C++ clang options
it: C/C++ clang opzioni

source: Code completion options...
it: Opzioni di completamento del codice ...

source: Components: driver %s, MPDM %s, MPSL %s (%s)
it: Componenti: driver %s, MPDM %s, MPSL %s (%s)

source: Completion with clang...
it: Completamento con clang ...

source: Completion
it: Completamento

source: Play "Puzzle"
it: Riproduci "Puzzle"

source: No completion found
it: Nessun completamento trovato

source: Puzzle - order the list by moving the blank
it: Puzzle: ordina l'elenco spostando lo spazio vuoto

source: Toggle visual wrap
it: Attiva/Disattiva l'involucro visivo

source: Internal error
it: Errore interno

source: About
it: Circa

source: Check for updates
it: Controlla gli aggiornamenti

source: Release notes
it: Note di rilascio
