Repository: ttcdt/mp-5.x
Catalog: po/*.po
Languages: it

source: Password (again)
it: Password (ancora)

source: Error: Passwords mismatch.
it: Errore: Le Password non corrispondono.

source: <help on keys>
it: <Aiuto tasti>

source: <none>
it: <nulla>

source: Unlinked functions
it: Funzioni scollegate

source: Line to go to
it: Linea a cui andare

source: <unnamed>
it: <Senza nome>

source: Enter file name:
it: Inserire nome del file:

source: File '%s' not found.
it: File '%s' non trovato.

source: Can't create file '%s'.
it: Impossibile scrivere file '%s'.

source: File has changed. Save changes?
it: Il file e' cambiato. Salvare i cambiamenti?

source: System command
it: Comando di sistema

source: Error executing command.
it: Errore eseguendo il comando.

source: Open documents
it: Apri documenti

source: Template file not found (%s)
it: File modello non trovato (%s)

source: Select template
it: Seleziona modello

source: Text to seek
it: Testo da cercare

source: Text not found.
it: Testo non trovato.

source: Replace text
it: Sostituisci testo

source: Replace with
it: Sostituisci con

source: To end of file?
it: Fine del file?

source: Files to grep (empty, all)
it: File in grep (vuoto, tutto)

source: Tag to seek
it: Tag da cercare

source: Word wrap on column (0, no word wrap)
it: A capo automatico sulla colonna (0, nessun ritorno a capo automatico)

source: Tab size:
it: Dimensioni della scheda:

source: Function to execute:
it: Funzione da eseguire:

source: Function not found (%s)
it: Funzione non trovata (%s)

source: Tag list
it: Lista tag

source: Tag(s) not found.
it: Tag(s) non trovato(i).

source: ESC Cancel
it: ESC Cancella

source: Y
it: S

source: [Y/N]
it: [S/N]

source: [ENTER]
it: [INVIO]

source: <about Minimum Profit>
it: <circa Minimo Profitto>

source: Yes
it: Si

source: Cancel
it: Cancella

source: No usable video driver found.
it: Nessun driver video utilizzabile trovato.

source: Bad mode.
it: Modo errato.

source: <help about '%s'>
it: <aiuto su '%s'>

source: No help for '%s'
it: Nessun aiuto per '%s'

source: %%Empty template file This template file is empty. To create templates, write a name for each one (marked by two % characteres together in the beginning of the line) and a text body, delimited by the next template name or the end of file. By selecting a template from the list (popped up by Ctrl-U), it will be inserted into the current text.
it: %%File modello vuoto Questo file modello è vuoto. Per creare modelli, scrivi un nome per ognuno (contrassegnato da due caratteri % insieme all'inizio di la riga) e un corpo di testo, delimitato dal nome del modello successivo o alla fine del file. Selezionando un modello dall'elenco (apparso di Ctrl-U), verrà inserito nel testo corrente.

source: # # Minimum Profit Config File #
it: # # File configurazione min. profitto #

source: &Edit
it: &Modifica

source: &Search
it: &Cerca

source: &Go to
it: &Vai A

source: &Options
it: &Opzioni

source: menu
it: menù

source: Line up
it: Freccia su'

source: Line down
it: Freccia giu'

source: Character left
it: Carattere sinistra

source: Character right
it: Carattere destra

source: Word left
it: Parola a sinistra

source: Word right
it: Parola a destra

source: End of line
it: Fine riga

source: Beginning of line
it: Inizio riga

source: End of document
it: Fine documento

source: Beginning of document
it: Inizio documento

source: Page up
it: Pagina su'

source: Page down
it: Pagina giu'

source: Go to line...
it: Vai alla riga...

source: Insert line
it: Inserisci riga

source: Insert tab
it: Inserisci tabulazione

source: Delete char over cursor
it: Elimina il carattere sopra il cursore

source: Delete char to the left of cursor
it: Elimina il carattere alla sinistra del cursore

source: Delete line
it: Elimina la riga

source: Mark beginning/end of block
it: Marca la fine/inizio del blocco

source: Unmark block
it: Smarca il blocco

source: Copy block
it: Copia il blocco

source: Paste block
it: Incolla il blocco

source: Cut block
it: Taglia il blocco

source: Search text...
it: Cerca testo...

source: Search next
it: Cerca successivo

source: Replace...
it: Sostituisci...

source: Replace in all...
it: Sostituisci tutti...

source: Next
it: Prossimo

source: New
it: Nuovo

source: Open...
it: Apri...

source: Reopen...
it: Riapri...

source: Save...
it: Salva...

source: Save as...
it: Salva come...

source: Close
it: Chiudere

source: Open file under cursor
it: Apri il file sotto il cursore

source: Increment font size
it: Aumenta la grandezza del carattere

source: Decrement font size
it: Diminuisci la grandezza del carattere

source: Insert/Overwrite
it: Inserisci/Sovrascrivi

source: Case sensitive
it: Tieni conto del maiuscolo o minuscolo

source: Save tabs
it: Salva tabulazioni

source: Save LF as CR/LF
it: Salva LF come CR/LF

source: Automatic indentation
it: Indentazione automatica

source: Mark column #80
it: Segna colonna 80

source: Use regular expressions
it: Usa espressioni regolari

source: Help for word under cursor
it: Aiuto x la parola sotto il cursore

source: Run system command...
it: Esegui comando di sistema...

source: Document list
it: Lista dei documenti

source: Search tag...
it: Cerca tag...

source: Insert template...
it: Inserisci modulo...

source: Complete tag...
it: Completa tag...

source: Edit templates file
it: Modifica file dei moduli

source: Edit configuration file
it: Modifica il file di configurazione

source: Word wrap...
it: A capo automatico ...

source: Tab size...
it: Lunghezza del tab...

source: Menu
it: Menù

source: About...
it: Circa...

source: Exit
it: Esci

source: Play macro
it: Esegui macro

source: Record macro
it: Registra macro

source: Help on keys
it: Aiuto nei tasti

source: Position cursor with mouse
it: Posiziona il cursore col mouse

source: Execute editor function...
it: Esegui funzione dell'editor...

source: Save modified texts
it: Salva il testo modificato

source: Grep (find inside) files...
it: File Grep (trova all'interno) ...

source: Select last successful search
it: Seleziona l'ultima ricerca effettuata

source: Show clipboard
it: Mostra gli appunti

source: Show log
it: Mostra i log

source: Break hardlinks on write
it: Rompere i collegamenti fisici in scrittura

source: Password protect...
it: Protetto da Password...

source: Suspend application
it: Applicazione sospesa

source: Reformat paragraph using word-wrapping
it: Riformatta paragrafo utilizzando lo word-wrapping

source: Insert new line above cursor
it: Inserisce una nuova riga sopra il cursore

source: Insert new line below cursor
it: Inserisci una nuova riga sotto al cursore

source: Join current line to one above
it: Unisci la riga corrente con quella sopra

source: Join current line to one below
it: Unisci la riga corrente con quella sotto

source: Flip letter case if A-Z or a-z
it: Scambia le maiuscole se A-Z o a-z

source: Flip word case
it: Cambia parole Maiuscole-Minuscole

source: Delete all whitespace after cursor
it: Cancella tutti gli spazi vuoti dopo il cursore

source: Delete to the beginning of word
it: Cancella fino all'inizio della parola

source: Delete to the end of word
it: Cancella fino alla fine della parola

source: Delete whole word
it: Cancella tutta la parola

source: Sort lines
it: Ordina linee

source: Error executing user defined function
it: Errore di esecuzione della funzione definita dall'utente

source: <Output of "%s">
it: Uscita di "%s">

source: Toggle insert/overwrite
it: Alterna inserisci/sovrascrivi

source: Reformat paragraph with word wrapping
it: Riformatta paragrafo con word-wrapping

source: Move to previous instance of current char
it: Sposta alla precedente istanza del carattere corrente

source: Move to next instance of current char
it: Sposta alla prossima istanza del carattere corrente

source: Select last succesful search
it: Seleziona l'ultima ricerca effettuata

source: Jump to matching bracket
it: Salta alla parentesi corrispondente

source: Previous
it: Precedente

source: Usage: mp [options] [file [file ...]] Options: -t|--tag [tag] Edits the file where tag is defined -w|--word-wrap [col] Sets wordwrapping in column col -ts|--tab-size [size] Sets tab size -ai|--autoindent Sets automatic indentation mode -l|--lang [lang] Language selection -m|--mode [mode] Syntax-hilight mode --col80 Marks column # 80 -bw|--monochrome Monochrome -tx|--text Use text mode (instead of GUI) -sp|--spellcheck Active spellchecking -h|--help This help screen -hw|--hardware-cursor Activates the use of hardware cursor --mouse Activate mouse usage for cursor positioning -nt|--no-transparent Disable transparent mode (eterm, aterm, etc.)
it: Uso: mp [opzioni] [file [file ...]] Opzioni: -t|--tag [tag] Edita il file dove e' definito tag -w|--word-wrap [col] Attiva il wordwrapping alla colonna col -ts|--tab-size [size] Definisce la lunghezza delle tabulazioni -ai|--autoindent Attiva l'indentazione automatica -l|--lang [lang] Seleziona il linguaggio -m|--mode [modo] Modi del syntax-hilight --col80 Marca la colonna 80 -bw|--monochrome Bianco e nero -tx|--text Usa modo testo (anzichè GUI) -h|--help Questa piccola schermata -hw|--hardware-cursor Attiva l'uso del cursore hardware --mouse Attiva l'uso del mouse per il posizionamento del cursore -nt|--no-transparent Disattiva la trasparenza (eterm, aterm, etc.)

source: Can't execute '%s'
it: Impossibile eseguire "%s"

source: Spellchecking is only available under Unix systems.
it: Il controllo ortografico è disponibile solo nei sistemi Unix.

source: Mark spelling errors
it: Contrassegna gli errori di ortografia

source: Usage: mp [options] [file [file ...]] Options: -t|--tag [tag] Edits the file where tag is defined -w|--word-wrap [col] Sets wordwrapping in column col -ts|--tab-size [size] Sets tab size -ai|--autoindent Sets automatic indentation mode -l|--lang [lang] Language selection -m|--mode [mode] Syntax-hilight mode --col80 Marks column # 80 -bw|--monochrome Monochrome -tx|--text Use text mode (instead of GUI) -h|--help This help screen -hw|--hardware-cursor Activates the use of hardware cursor --mouse Activate mouse usage for cursor positioning -nt|--no-transparent Disable transparent mode (eterm, aterm, etc.)
it: Utilizzo: mp [opzioni] [file [file ...]] Opzioni: -t | --tag [tag] Modifica il file in cui è definito il tag -w | --word-wrap [col] Imposta il wordwrapping nella colonna col -ts | --tab-size [size] Imposta la dimensione della scheda -ai | --autoindent Imposta la modalità di rientro automatico -l | --lang [lang] Selezione della lingua -m | --mode [mode] Modalità sintassi-hilight --col80 Segna la colonna # 80 - bw | --monochrome Monocromatico -tx | --text Usa la modalità testo (invece della GUI) -h | --help Questa schermata di aiuto -hw | --hardware-cursor Attiva l'uso del cursore hardware --mouse Attiva l'uso del mouse per il posizionamento del cursore -nt | --no-transparent Disabilita la modalità trasparente (eterm, aterm, ecc.)

source: Passwords don't match.
it: Le password non corrispondono.

source: Word wrapping must be set
it: È necessario impostare il ritorno a capo automatico

source: Insert space
it: Inserisci spazio

source: Delete character
it: Cancella carattere

source: Delete character to the left
it: Cancella carattere a sinistra

source: Undo
it: Scartare

source: Join a paragraph in one line
it: Unisci un paragrafo in una riga

source: Word-wrap a paragraph
it: A capo automatico di un paragrafo

source: Save file as
it: Salva file come

source: Error saving file: %s
it: Errore salvataggio file: %s

source: File to open
it: File da aprire

source: Code to execute
it: Codice da eseguire

source: Error:
it: Errore:

source: Exit value:
it: Valore di uscita:

source: Execute MPSL code...
it: Esegui codice MPSL ...

source: Execute document as MPSL
it: Esegui documento come MPSL

source: Bigger font
it: Carattere più grande

source: Smaller font
it: Carattere più piccolo

source: Move cursor to mouse click
it: Sposta il cursore sul clic del mouse

source: Mouse wheel up
it: Rotellina del mouse su

source: Mouse wheel down
it: Rotellina del mouse giù

source: Global replace
it: Sostituzione globale

source: File(s) not found.
it: File non trovato.

source: Search previous
it: Cerca precedente

source: No help for '%s'.
it: Nessun aiuto per '%s'.

source: <help on '%s'>
it: <aiuto nel '%s'>

source: Help on word over cursor
it: Aiuto sulla parola tramite cursore

source: No matching symbol found.
it: Nessun simbolo corrispondente trovato.

source: Select symbol
it: Seleziona il simbolo

source: Symbol completion...
it: Completamento del simbolo ...

source: Tag not found.
it: Tag non trovato.

source: Select tag
it: Seleziona tag

source: Template to insert
it: Modello da inserire

source: Line termination
it: Terminazione di linea

source: Tab size
it: Dimensioni tab

source: Convert tabs to spaces
it: Converti tab in spazi

source: Line options...
it: Opzioni di linea ...

source: Tab options...
it: Opzioni tab...

source: File has changed. Are you sure?
it: Il file è cambiato. Sei sicuro?

source: Error writing command '%s'
it: Errore durante la scrittura del comando '%s'

source: Error reading from command '%s'
it: Errore durante la lettura dal comando '%s'

source: Revert
it: Ripristina

source: Encoding (utf-8, iso8859-1, etc.; empty, current locale)
it: Encoding (utf-8, iso8859-1, ecc.; vuoto, valuta locale)

source: Invalid encoding
it: Codifica non valida

source: Lines: %d Words: %d
it: Righe: %d Parole: %d

source: Set charset encoding...
it: Imposta codifica set di caratteri ...

source: Count words
it: Conta le parole

source: Toggle spellchecking
it: Attiva il controllo ortografico

source: Please, wait...
it: Attendi...

source: Error writing to command '%s'
it: Errore durante la scrittura nel comando '%s'

source: Redo
it: Rifare

source: Complete...
it: Completare...

source: Select
it: Selezionare

source: No session file was found to load
it: Nessun file di sessione trovato da caricare

source: Could not be found and was not opened
it: Impossibile trovare e non è stato aperto

source: Load session
it: Carica sessione

source: Save session
it: Salva sessione

source: Unknown action '%s'
it: Azione sconosciuta '%s'

source: Unbound keystroke '%s'
it: Sequenza di tasti non associata '%s'

source: New file '%s'
it: Nuovo file '%s'

source: %d replaces
it: %d sostituisce

source: Cannot open '%s'
it: Non può essere aperto '%s'

source: WARNING: %s version found is %s, but %s is needed
it: ATTENZIONE: la versione di %s trovata è %s, ma è necessario %s

source: Mark using mouse dragging
it: Segna utilizzando il trascinamento del mouse

source: Mark end of lines
it: Segna la fine delle righe

source: Close all
it: Chiudi tutto

source: No Makefile targets found.
it: Non creare file di destinazione trovati.

source: Makefile target
it: Crea file di destinazione

source: No errors nor warnings found.
it: Nessun errore né avviso trovato.

source: Errors and Warnings
it: Errori e avvisi

source: Build project...
it: Crea progetto ...

source: Read-only document
it: Documento solo lettura

source: Mark vertical block
it: Segna blocco verticale

source: No detection for sections for this mode.
it: Nessun rilevamento per le sezioni di questa modalità.

source: No sections were found in this document.
it: Nessuna sezione è stata trovata in questo documento.

source: Section list
it: Elenco delle sezioni

source: Section list...
it: Elenco delle sezioni...

source: Search misspelled word
it: Cerca parole con errori di ortografia

source: Ignore last misspelled word
it: Ignora l'ultima parola con errori di ortografia

source: Number of letters at the start or end
it: Numero di lettere all'inizio o alla fine

source: Maximum distance
it: Massima distanza

source: Search repeated words...
it: Cerca parole ripetute...

source: Search repeated word
it: Cerca parola ripetuta

source: Base directory (empty, current)
it: Directory di base (vuota, attuale)

source: Recursive?
it: Ricorsivo?

source: Maximum distance between words
it: Massima distanza tra le parole

source: Repeated words options...
it: Opzioni parole ripetute...

source: Delete block
it: Cancella blocco

source: Keep original end of lines
it: Mantieni la fine delle righe originale

source: Hexadecimal viewer...
it: Visualizzatore esadecimale...

source: Open dropped files
it: Apri i file rilasciati

source: Use previous line for tab columns
it: Usa la riga precedente per le colonne delle tabulazioni

source: Insert next item
it: Inserisci l'elemento successivo

source: Toggle insert/overwrite mode
it: Attiva / disattiva la modalità di inserimento/sovrascrittura

source: Filter selection through system command...
it: Filtra la selezione tramite il comando di sistema ...

source: Mark all
it: Segna tutto

source: Select action to execute
it: Seleziona l'azione da eseguire

source: Execute action on document...
it: Esegui azione sul documento ...

source: Cut lines containing
it: Linee di taglio contenenti

source: Cut lines containing a string...
it: Linee di taglio contenenti una stringa ...

source: Insert real tab character
it: Inserisci un carattere di tabulazione reale

source: Indent block
it: Rientro blocco

source: Unindent block
it: Annulla rientro blocco

source: Template file to edit
it: File modello da modificare

source: 'Smart' move to beginning of line
it: Spostamento 'intelligente' all'inizio della riga

source: This directory is not under a supported version control system
it: Questa directory non è in un sistema di controllo della versione supportato

source: Available %s commands
it: Comandi %s disponibili

source: <%s output>
it: <%s uscita>

source: Version Control...
it: Controllo della versione ...

source: Play "Pipes"
it: Riproduci "Pipes"

source: You won! Press any key.
it: Hai vinto! Premere un qualsiasi tasto.

source: You already have the latest version.
it: Hai già l'ultima versione.

source: There are new versions available:
it: Sono disponibili nuove versioni:

source: Update Minimum Profit from http://triptico.com/software/mp.html
it: Aggiorna il profitto minimo da http://triptico.com/software/mp.html

source: Cannot connect -- please try later.
it: Impossibile connettersi. Riprova più tardi.

source: Check for updates...
it: Controlla gli aggiornamenti...

source: &Project
it: &Progetto

source: &Writing
it: &Scrittura

source: Bad password for file '%s'
it: Password errata per il file '%s'

source: Error opening file '%s': %s
it: Errore apertura file '%s': %s

source: Move one section up
it: Sposta una sezione in alto

source: Move one section down
it: Sposta una sezione in basso

source: Pipes - carry water from top to bottom by turning the pipes
it: Tubi: trasportare l'acqua dall'alto verso il basso ruotando i tubi

source: Error saving '%s': %s
it: Errore salvataggio '%s': %s

source: '%s' has changed. Are you sure?
it: '%s' è cambiato. Sei sicuro?

source: '%s' was changed externally. Reload?
it: '%s' è stato modificato esternamente. Ricaricare?

source: '%s' has changed. Save changes?
it: '%s' è cambiato. Salvare le modifiche?

source: Error opening '%s': %s
it: Errore apertura '%s': %s

source: <current locale>
it: <valuta locale>

source: Available encodings
it: Codifiche disponibili

source: You have a development version newer than any stable release.
it: Hai una versione di sviluppo più recente di qualsiasi versione stabile.

source: Folder to open
it: Cartella da aprire

source: Open folder...
it: Apri cartella...

source: <listing of %s>
it: <elenco di %s>

source: Directory editor
it: Editor directory

source: Deleting a line deletes the file;
it: L'eliminazione di una riga cancellata nel file;

source: Changing a line renames the file;
it: La modifica di una riga rinominata nel file;

source: Saving commits the changes.
it: Il salvataggio impegna le modifiche.

source: (Keep the 'number:' on each line untouched)
it: (Mantieni intatto il "numero:" su ogni riga)

source: <changes to directory '%s'>
it: <cambia alla directory '%s'>

source: # error renaming '%s' to '%s' (%s)
it: # errore rinomina '%s' to '%s' (%s)

source: # renamed '%s' to '%s'
it: # rinominare '%s' nel '%s'

source: # error deleting '%s' (%s)
it: # errore cancellazione '%s' (%s)

source: # deleted '%s'
it: # cancellato '%s'

source: Insert time stamp
it: Inserisci data e ora

source: No build targets found.
it: Nessun obiettivo di creazione trovato.

source: Build target
it: Crea obbiettivo

source: Error executing '%s'
it: Errore esecuzione '%s'

source: Show line numbers
it: Mostra i numeri di riga

source: Not found.
it: Non trovato.

source: Hex string to seek
it: Stringa esadecimale da cercare

source: Mark selection block
it: Contrassegna il blocco di selezione

source: Mark vertical selection block
it: Contrassegna il blocco di selezione verticale

source: Suspend
it: Sospendi

source: Select word under cursor
it: Seleziona la parola sotto il cursore

source: Search wrapped
it: Ricerca avvolta

source: Move to the matching bracket
it: Passa alla parentesi corrispondente

source: Cut line
it: Taglia linea

source: RTF file name
it: RTF nome file

source: Export as RTF...
it: Esporta come RTF...

source: Scroll document down
it: Scorri il documento verso il basso

source: Scroll document up
it: Scorri il documento verso l'alto

source: Insert page break character (FF)
it: Inserisci carattere di interruzione di pagina (FF)

source: Insert m-dash character
it: Inserisci il carattere trattino m

source: Insert raw string
it: Inserisci una stringa raw

source: %d lines replaced
it: %d linee sostituite

source: Replace tabs with spaces
it: Sostituisci le tabulazioni con spazi

source: Replace spaces with tabs
it: Sostituisci gli spazi con le tabulazioni

source: Maze - help %s to find the treasure. As always, the X marks the spot.
it: Labirinto: aiuta %s a trovare il tesoro. Come sempre, la X segna il punto.

source: Recent files
it: File recenti

source: Open recent files...
it: Apri i file recenti...

source: <hex view of %s>
it: <visualizza esa nel %s>

source: Play "Maze"
it: Riproduci "Labirinto"

source: Minimum Profit %s - Programmer Text Editor
it: Profitto minimo %s - Editor di testo del programmatore

source: Usage: mp-5 [options] [files...] Options: -t {tag} Edits the file where tag is defined -e {mpsl_code} Executes MPSL code -f {mpsl_script} Executes MPSL script file -d {directory} Set current directory -x {file} Open file in the hexadecimal viewer -txt Use text mode instead of GUI +NNN Moves to line number NNN of last file
it: Utilizzo: mp-5 [opzioni] [file ...] Opzioni: -t {tag} Modifica il file in cui è definito il tag -e {mpsl_code} Esegue il codice MPSL

source: Components: driver %s, MPDM %s, MPSL %s
it: Componenti: driver %s, MPDM %s, MPSL %s

source: # nothing changed.
it: # niente è cambiato.

source: <internal errors>
it: <errore interno>

source: Maze - help %s to find the treasure. As always, the %s marks the spot.
it: Labirinto: aiuta %s a trovare il tesoro. Come sempre, %s segna il punto.

source: You won! Press ENTER.
it: Hai vinto! Premere INVIO.

source: Export to file (available formats:
it: Esporta su file (formati disponibili:

source: Error exporting '%s': %s
it: Errore esportazione '%s': %s

source: Unknown export format '%s'. Available: [%s]
it: Formato esportazione sconosciuto '%s'. Disponibile: [%s]

source: Export...
it: Esporta...

source: Unknown export format '%s'. Available: [%s]
it: Formato di esportazione sconosciuto "%s". Disponibile: [%s]

source: Unsupported format '%s'. (Not one of: [%s])
it: Formato "%s" non supportato. (Non uno di: [%s])
